Revit 2027 API
PatternJustification Enumeration
 Justification of patterns distribution.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum PatternJustification
Public Enumeration PatternJustification
public enum class PatternJustification
type PatternJustification
Members
Member name | Value | Description
Beginning | 0 |  Patterns are distributed starting from the beginning of a railing path.
Center | 2 |  Patterns are distributed starting from the center of a railing path.
End | 1 |  Patterns are distributed starting from the ending of a railing path.
SpreadPatternToFit | 3 |  Patterns are distributed to not last excess length.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace